Tekla.Structures.Catalogs.UserPropertyItemEnumerator
The UserPropertyItemEnumerator class allows to loop through the user property items.
The following example returns true if an item with the name "comment" has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
UserPropertyItemEnumerator UserPropertyItemEnumerator = CatalogHandler.GetUserPropertyItems();
while (UserPropertyItemEnumerator.MoveNext())
{
UserPropertyItem UserPropertyItem = UserPropertyItemEnumerator.Current as UserPropertyItem;
if (UserPropertyItem.Name == "comment")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.#ctor
Enumerator for all user property items.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.#ctor(Tekla.Structures.Catalogs.CatalogObjectTypeEnum)
Enumerator for user property items of object type.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type ProfileItem.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.Current
Returns a user property item instance of the current element.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.UserPropertyItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.